Центр_управления_производительностью_демо/src/Catalogs/Показатели/Показатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Показатели</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Анализ</name>
      <description>Анализ</description>
    </items>
    <items>
      <name>Взаимоблокировки</name>
      <description>Взаимоблокировки</description>
    </items>
    <items>
      <name>Запросы</name>
      <description>Запросы</description>
    </items>
    <items>
      <name>Качество</name>
      <description>Качество</description>
    </items>
    <items>
      <name>ОжиданияНаБлокировках</name>
      <description>Ожидания на блокировках</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ПроизводительностьОборудования</name>
      <description>Производительность оборудования</description>
    </items>
    <items>
      <name>СерверныеВызовы</name>
      <description>Серверные вызовы</description>
    </items>
  </predefined>
  <attributes>
    <name>ГраницаЖК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаЗЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметр</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
        <types>EnumRef.СпособыСбораСчетчиков</types>
        <types>CatalogRef.СчетчикиПроизводительности</types>
        <types>CatalogRef.АгентыЦКК</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоддержкаСУБД</name>
    <attributes>
      <name>АвтоматическийРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСУБД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмешанныйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОС</name>
      <type>
        <types>EnumRef.ТипыОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСУБД</name>
      <type>
        <types>EnumRef.ТипыСУБД</types>
      </type>
    </attributes>
    <attributes>
      <name>УправляемыйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Catalogs/Показатели/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ

// Получить значение параметра по имени
//
// Параметры:
//  ИмяПараметра - Строка
//
// Возвращаемое значение:
//  Составной, значение параметра
Функция ПолучитьЗначениеПараметра(ИмяПараметра) Экспорт
	
	СтрокаПараметра = ЭтотОбъект.Параметр.Найти(ИмяПараметра, "Имя");
	
	Если СтрокаПараметра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипПараметра = ВРег(СтрокаПараметра.Тип);
	Если ТипПараметра = "BOOLEAN" Тогда
		Возврат Булево(СтрокаПараметра.Значение);
	ИначеЕсли ТипПараметра = "INTEGER" Тогда
		Возврат Число(СтрокаПараметра.Значение);
	ИначеЕсли ТипПараметра = "STRING" Тогда
		Возврат Строка(СтрокаПараметра.Значение);
	Иначе
		Возврат СтрокаПараметра.Значение;
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПараметра()

// Установить значение параметра
//
// Параметры:
//  ИмяПараметра - Строка
//  Значение - Составной
//
Процедура УстановитьЗначениеПараметра(ИмяПараметра, Значение) Экспорт
	
	СтрокаПараметра = ЭтотОбъект.Параметр.Найти(ИмяПараметра, "Имя");
	
	Если СтрокаПараметра = Неопределено Тогда
		СтрокаПараметра = ЭтотОбъект.Параметр.Добавить();
		СтрокаПараметра.Имя = ИмяПараметра;
	КонецЕсли;
	
	СтрокаПараметра.Значение = Значение;
	
КонецПроцедуры // УстановитьЗначениеПараметра()

// Получить значение параметра минимальной длительности запроса
//
// Возвращаемое значение:
//  Число - минимальная длительность запроса
//
Функция ПолучитьМинимальнуюДлительностьЗапроса() Экспорт
	
	МинимальнаяДлительностьЗапроса = ПолучитьЗначениеПараметра("Минимальная длительность запроса (сек.)");
	
	Если МинимальнаяДлительностьЗапроса = Неопределено Тогда
		МинимальнаяДлительностьЗапроса = 2;
	КонецЕсли;
	
	Возврат МинимальнаяДлительностьЗапроса;
	
КонецФункции // ПолучитьМинимальнуюДлительностьЗапроса()

// Получить значение параметра минимальной длительности серверного вызова
//
// Возвращаемое значение:
//  Число - минимальная длительность
//
Функция ПолучитьМинимальнуюДлительностьСерверногоВызова() Экспорт
	
	МинимальнаяДлительностьВызова = ПолучитьЗначениеПараметра("Минимальная длительность вызова (сек.)");
	
	Если МинимальнаяДлительностьВызова = Неопределено Тогда
		МинимальнаяДлительностьВызова = 2;
	КонецЕсли;
	
	Возврат МинимальнаяДлительностьВызова;
	
КонецФункции // ПолучитьМинимальнуюДлительностьСерверногоВызова()

// Определить необходимость получения планов запросов
//
// Возвращаемое значение:
//  Булево - необходимость получения планов запросов
//
Функция ПолучатьПланыЗапросов() Экспорт
	
	Планы = ПолучитьЗначениеПараметра("Получать планы запросов");
	
	Если Планы = Неопределено Тогда
		Планы = Истина;
	КонецЕсли;
	
	Возврат Планы;
	
КонецФункции // ПолучатьПланыЗапросов()
